{
  "meta": {
    "exported_on": 1680399224,
    "version": "5.39.0"
  },
  "data": {
    "posts": [
            
      {
        "id": "0",
        "title": "Gating My Content",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><h1 id='gating-content-in-jamstack-sites'>Gating Content in JAMstack Sites</h1><p>This section’s title was borrowed from a <a href='https://www.stackbit.com/'>Stackbit</a> article with the same title, <a href='https://www.stackbit.com/blog/gating-content-jamstack'>Gating Content in JAMstack Sites</a>.  Working through that article to password protect some of the content at <a href='https://Wieting.TamaToledo.com'>https://Wieting.TamaToledo.com</a> is my tech pursit today.</p><h1 id='nope-not-on-netlify'>Nope, Not on Netlify</h1><p>😦Last evening I took a shot at implementing the <em>Netlify Identity</em> tricks from the aforementioned article, but could not easily get it to work.  The problem, I think, is that the <a href='https://Wieting.TamaToledo.com'>https://Wieting.TamaToledo.com</a> on <em>Netlify</em> already uses <em>Netlify Identity</em> for authentication of my <em>Netlify CMS</em> forms, and adding a second, separate instance of that service isn’t trivial and perhaps isn’t even feasible.  I also tried implementing some quick <a href='https://www.npmjs.com/package/staticrypt'>Staticrypt</a> CLI protection but that also failed.  <em>Netlify</em> does provide a really quick and painless solution, but it costs $20/month, at a minimum, to enable it.</p><h1 id='new-staticrypt-strategy'>New Staticrypt Strategy?</h1><p>So, my next shot at this will involve creating a new <a href='https://www.11ty.dev/'>Eleventy</a> site just for the Wieting’s protected content.  Wish me luck and follow along here if you like.</p><h1 id='trying-azure-devops'>Trying Azure DevOps</h1><p>I recently created a personal Azure account, registered to <em>summitt.dweller@gmail.com</em>, and last evening (January 31, 2023) I took a dive into <a href='index.html'>Azure DevOps</a> under that account.  The “welcome” email that I received says I now have an “organization” URL at <a href='https://dev.azure.com/summittdweller'>https://dev.azure.com/summittdweller</a>.</p><p>I jumped into Azure DevOps because it looks like within that environment I can establish a Content Management System (CMS) not unlike the <em>NetlifyCMS</em> (or perhaps it IS NCMS) that I run for the Wieting Theatre, hosted with Netlify.com.  I really like <em>NetlifyCMS</em>, but thus far I’ve had limited success with it, and ONLY at Netlify.com where the user authentication process is nicely streamlined.  I hope that Azure DevOps has user authentication that’s just as easy to manage, and at less cost.</p><p>So, I guess the strategy now is to see what Azure DevOps has to offer, rather than venturing further with <a href='https://www.npmjs.com/package/staticrypt'>Staticrypt</a>.</p><hr/><p>That’s a TEMPORAY wrap, this post isn’t finished just yet.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1675036800000
      }

,
      
      {
        "id": "1",
        "title": "Thanksgiving 2020",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Sorry, I’ve posted and experienced too much sadness in the last two weeks, and more. Two members of our immediate family, Sully and Stitch, passed away on November 14th and 20th, respectively. Sully was our male kitty, only about 6 years old and his passing was a real shock.  He was an ornery, sometimes grumpy cat, but very loveable at times. We miss him very much. Stitch was the matriarch of our cat family, about 18 years old and a gorgeous long-haired kitty. Stitch was in poor health the last year or so and not very playful so her passing was not such a shock, but it’s still hard to take. Fortunately, she passed comfortably in her sleep, nestled up on the couch between Mackenzie and Christine. We miss her too.</p><p>Sully and Stitch were buried on the McCune farm just a few days apart, not immediately next to one another, but not too far apart.  They sometimes played together when Stitch would tolerate Sully, but most of the time they were a short distance apart, just as they are now.</p><p>Enough of that, since today is Thanksgiving I’ll post no more sad news.  Instead, I want to share what I’m most thankful for… family.  And our family has two new fur babies too, Georgie and Jo.  Both are named after characters from Stephen King novels… perhaps a new trend?  Let me explain…</p><p>Georgie is the best-tempered cat I have ever known. 😸 She’s a little over a year old now so she still loves to play, and she’s made a habit of insisting that I hold her at least a couple of times each day, and give her kitty treats in exchange for snuggles. We captured Georgie in December 2019, she was the last of 3 kittens and 5 adult cats (Uno, Deuce, Tres, Veer and Go) that we caught as part of a TNR (Trap, Neuter and Release) effort that we started as the weather started to turn colder.  Georgie’s siblings found homes at the Tama Co. Humane Shelter (and later with a family in Belle Plaine) and with Morgan, who adpoted “Lint”, a long-haired solid gray kitten that was an odd part of the short-haired tuxedo cats living next door.</p><p><figure><img alt='Georgie - Approx. Age 13 Months' src='https://images.summittdweller.com/Kitty-Photos/Georgie/IMG_0051.png'/><figcaption>Georgie - Approx. Age 13 Months</figcaption></figure><figure><img alt='Georgie - Play with Me!' src='https://images.summittdweller.com/Kitty-Photos/Georgie/IMG_0057.png'/><figcaption>Georgie - Play with Me!</figcaption></figure></p><p>Georgie was the last of the 8 cats that we caught and she managed to avoid the traps quite well. Since we were concerned for her wellbeing, as she was all alone, we decided to try and catch her without a trap, and managed to do so after she elluded us for an hour or so.  She managed to get away by ducking into a storm sewer opening down the street, that’s why we named her Georgie, after the poor little boy featured in the opening of King’s story, “It”. Like “It”, she’s also a “collector”, always picking things up and carrying them away to who-knows-where.  😄</p><p>Jo, or JoJo, or Joey, or Cujo, is the new addition to the family. 🐱  Even before Stitch passed we put the word out that we might be looking for another kitty, somebody to keep Georgie company when no humans are home.  Well, we received word of a farm kitten looking for a home and paid it a visit one week ago on Thursday night, November 19. Stitch passed the next evening and on Sunday, November 22nd, the kitten came to live with us.  She saw the vet on Monday for an initial checkup and she’s sequestered in a spare bedroom for about 2 weeks to give her eyes and nose a chance to clear up… that process has started but she’s still got some eye goop as you can see.</p><p><figure><img alt='Jo - Approx. Age 2 Months' src='https://images.summittdweller.com/Kitty-Photos/Jo/IMG_0038.png'/><figcaption>Jo - Approx. Age 2 Months</figcaption></figure><figure><img alt='Jo - In a Rare, Calm Moment' src='https://images.summittdweller.com/Kitty-Photos/Jo/IMG_0034.png'/><figcaption>Jo - In a Rare, Calm Moment</figcaption></figure><figure><img alt='Jo - The Wee Beastie Sleeps After Turkey Dinner' src='https://images.summittdweller.com/Kitty-Photos/Jo/theWeeBeastieSleeps.jpg'/><figcaption>The Wee Beastie Sleeps after Turkey Dinner</figcaption></figure></p><p>Mackenzie suggested we name her “Cujo” since the farmer’s dog got hold of her in the farmyard. Also, Stephen King. 😄 The farmer was going to keep her as an indoor kitty due to the dog incident, but was overruled by her spouse. Their loss, our gain. We decided that the name could also stand for “Cute Jo”, and that stuck, along with all the other forms of the name. Jo is all kitten, but not afraid of anyone. She’s quick to snuggle up, but also loves to claw and bite when she’s in a mood to play.  We are trying to teach her that toys=play while toes=snuggles, and the same for other body parts. I think she’ll come around just fine.  Just wish she didn’t have to quarantine for another 10 days. 😦  But of course, it’s #2020.</p><p>That’s a wrap. Until next time… but only after I play with Georgie and give Jo another snuggle.</p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1606348800000
      }

,
      
      {
        "id": "2",
        "title": "Finale Workflow Documentation",
        "mobiledoc": "{ \"version\":\"0.3.1\", \"markups\":[], \"atoms\":[], \"cards\":[[\"html\", { \"cardName\":\"html\", \"html\":\"<article class='post'><p><p>Mackenzie, my daughter, and I created this post documenting my wife’s <a href='https://www.finalemusic.com/'>Finale</a> workflow for scanning and editing music on her Mac.  We did this for my wife to <strike>celebrate her birthday</strike> preserve her sanity.  Well, it was worth a shot.  The birthday idea seemed more romantic, but mental health comes first.</p><p>The document was created using a process we recently built and documented in <a href='https://static.grinnell.edu/dlad-blog/posts/138-creating-better-documentation/'>Creating Better Documentation</a>.  In this instance of the process we tried to annotate in yellow screen capture elements that need attention, and used red annotation to indicate things that require input or action of some kind.  In some of the later images we failed and things that should be red were left highlighted in yellow.  Sorry.</p><h1 id='begin-by-scanning'>Begin by Scanning</h1><p>The first step involved launching the <em>Canon MF Scan Utility</em> as you see below.  This is the software she uses to scan music pages on the multi-function scanner attached to her Mac.</p><p><figure><img alt='Launch the Canon MF Scan Utility' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0010.png'/><figcaption>Launch the Canon MF Scan Utility</figcaption></figure></p><p>We verified that the correct scanner is selected, loaded the score into the scanner*, and clicked <code>Custom</code> to begin the scan.  Then, wait for the scanner to warm up, if necessary.</p><p>*Note that the sheet music can be placed on the scanner glass one-sheet-at-a-time, or if the pages are 8.5x11, one-sided, and in good condition, they may be loaded in the document feeder to scan continuously.  In this particular case we were able to use the document feeder.</p><p><figure><img alt='Select Custom scanning' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0015.png'/><figcaption>Select Custom scanning</figcaption></figure></p><p><figure><img alt='Waiting for the scanner to warm up' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0020.png'/><figcaption>Waiting for the scanner to warm up</figcaption></figure></p><p>Once the scanner is ready the mechanical process of scanning should begin.  When scanning one-page-at-a-time some user intervention will be required.</p><p><figure><img alt='Scanning in progress' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0028.png'/><figcaption>Scanning in progress</figcaption></figure></p><p>When the scan is complete a <code>Save Settings</code> window should pop-up.  We reviewed the information and made appropriate selections where noted below, then clicked <code>OK</code> to continue.  <strong>Be sure to set and take note of the <code>File Name:</code> and <code>Save in:</code> fields!  Also, it’s probably wise to ensure that the <code>Data Format:</code> is “TIFF” and the <code>Save to a subfolder with current date</code> control is checked.</strong></p><p><figure><img alt='Save scan settings' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0046.png'/><figcaption>Save scan settings</figcaption></figure></p><h1 id='smartscore-64-pro'>SmartScore 64 Pro</h1><p>A <em>SmartScore 64 Pro</em> window will automatically open, <strong>but don’t be confused, we don’t want to run this application yet!  Click the <code>Cancel</code> button to close <em>SmartScore 64 Pro</em></strong>.</p><p><figure><img alt='SmartScore Pro launches automatically' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0064.png'/><figcaption>SmartScore Pro launches automatically but needs to be closed</figcaption></figure></p><p>Once <em>SmartScore 64 Pro</em> is closed, we need to open it properly by clicking its icon in the dock.  😦</p><p><figure><img alt='Properly launching SmartScore' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0078.png'/><figcaption>Properly launching SmartScore</figcaption></figure></p><p>Now <em>SmartScore</em> is open to the <code>Task Window</code> where we selected <code>Recognition</code> to convert the scanned images to music XML.</p><p><figure><img alt='Starting the SmartScore recognition process' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0089.png'/><figcaption>Starting the SmartScore recognition process</figcaption></figure></p><p>Next, we add the files of our scanned pages to the recognition processing list.</p><p><figure><img alt='Add scans to SmartScore recognition' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0094.png'/><figcaption>Add scans to SmartScore recognition</figcaption></figure></p><p>In the file dialog we navigate to the scanned page TIFFs and select them all.  The order of files in the selection is NOT critical.  With all files selected click <code>Open</code>.</p><p><figure><img alt='Navigate to the scan files and select them' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0105.png'/><figcaption>Navigate to the scan files and select them</figcaption></figure></p><p>The next <code>Begin Recognition</code> screen offers controls to change the file order if necessary.  Once the files are in the proper order click <code>Begin Recognition</code> button to proceed.</p><p><figure><img alt='Order the TIFFs and begin recognition' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0134.png'/><figcaption>Order the TIFFs and begin recognition</figcaption></figure></p><p>Be patient, the recognition process may take a few minutes.</p><p><figure><img alt='Recognition in progress' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0151.png'/><figcaption>Recognition in progress</figcaption></figure></p><p>When the recognition is complete a <code>System Report</code> appeared prompting us to <code>Open SmartScore file</code>.  We did.</p><p><figure><img alt='SmartScore system report' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0155.png'/><figcaption>SmartScore system report</figcaption></figure></p><p>Next, the <code>Unify Score</code> window popped up and we verified the default selections shown below before clicking <code>OK</code>.</p><p><figure><img alt='Unify score pop-up' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0157.png'/><figcaption>Unify score pop-up</figcaption></figure></p><p>When prompted to save the score be sure to select <code>Music XML (*.xml)</code> and take note of where the file will be saved.</p><p><figure><img alt='Saving as XML' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0168.png'/><figcaption>Saving as XML</figcaption></figure></p><p>You may be prompted to save each scan/file individually.  Once the file save is confirmed you can close <em>SmartScore 64 Pro</em>.</p><p><figure><img alt='Confirm save and close SmartScore' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0189.png'/><figcaption>Confirm save and close SmartScore</figcaption></figure></p><h1 id='finale'>Finale</h1><p>Next, open <em>Finale</em> from the dock as shown below.</p><p><figure><img alt='Open Finale' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0199.png'/><figcaption>Open Finale</figcaption></figure></p><p>After a minute or more the <em>Finale</em> <code>Launch Window</code> should appear, and we selected <code>IMPORT MUSICXML</code> as shown below.</p><p><figure><img alt='Selecting IMPORT MUSICXML' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0209.png'/><figcaption>Selecting IMPORT MUSICXML</figcaption></figure></p><p>We navigated to the XML file that was saved in <em>SmartScore</em> and clicked <code>Open</code> to load it in <em>Finale</em>.</p><p><figure><img alt='Opening the saved MusicXML file' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0224.png'/><figcaption>Opening the saved MusicXML file</figcaption></figure></p><p>That’s it, the scanned score is now loaded in <em>Finale</em> where it is ready to be edited!  It’s a good idea to click <code>Save As...</code> routinely to save your changes as you proceed.</p><p><figure><img alt='Save your Finale work' src='https://sddocs.blob.core.windows.net/documentation/Finale-Workflow-Documentation/0237.png'/><figcaption>Save your Finale work</figcaption></figure></p></p></article>\" }]], \"sections\":[[10, 0]] }",
        "type": "post",
        "status": "published",
        "published_at": 1675814400000
      }


    ]
  }
}

